Revit 2027 API
ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadCombinationUIService Property
 The UI service which permits registration of an external server for UI managing Electrical Analytical Load Combination.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ElectricalAnalyticalLoadCombinationUIService { get; }
Public Shared ReadOnly Property ElectricalAnalyticalLoadCombinationUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ElectricalAnalyticalLoadCombinationUIService {
	ExternalServiceId^ get ();
}
static member ElectricalAnalyticalLoadCombinationUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace